package org.example;
/*
Array
    1.Java语言中的数组是一种引用数据类型。不属于基本数据类型。数组的父类是Object。
    2.数组实际上是一个容器，可以同时容纳多个元素。（数组是一个数据的集合。）
    数组：字面意思是“一组数据”
    3.数组当中可以存储“基本数据类型”的数据，也可以存储“引用数据类型”的数据。
    4.数组因为是引用类型，所以数组对象是堆内存当中。（数组是存储再堆当中的）
    5.数组当中如果存储的是“java对象”的话，实际上存储的是对象的“引用（内存地址）”,数组中不能直接存醋java对象。
    6.数组一旦创建，在java中规定，长度不可变。（数组长度不可变）
    7.数组的分类：一维数组、二维数组、三维数组、多维数组...（一维数组较多，二维数组偶尔使用！）
    8.所有的数组对象都有length属性（java自带的），用来获取数组中元素的个数。
    9.java中的数组要求数组中元素的类型同意。比如int类型数组只能存储int类型，Person类型数组只能存储Person类型。
     例如：超市购物，购物袋中只能装苹果，不能同时装苹果和橘子。
    10.数组在内存方面存储的时候，数组中的元素内存地址（存储的每一个元素都是有规则的挨着排列的）是连续的，内存地址连续。
     这是数组存储元素的特点（特点）。数组实际上是一种简单的数据结构。
    11.所有的数组都是拿“第一个小方框的内存地址”作为成个数组对象的内存地址。
    （数组中首元素的内存地址作为整个数组对象的内存地址。）
    12.数组中每一个元素都是有下标的，下标从0开始，以1递增。最后一个元素的下标是：length-1
    下标非常重要，因为我们对数组中元素进行“存取”的时候，都需要通过下标来进行。
    13.数组这种数据结构的优点和缺点是什么？
        优点：查询/查找/检索某个下标上的元素时效率极高。可以说是查询效率最高的一个数据结构。
            为什么检索
        缺点：
* */
public class ArrayTest01 {
    public static void main(String[] args) {
        Object object;
    }
}
